src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/CommonForms/УЗ_ПервыйЗапуск/Ext/Form/Module.bsl
//Помощник первого запуска «Учёта занятий»: семь шагов от пустой базы до первой группы с учениками — организация,
//касса, предметы, педагоги со ставкой, цена занятия, группа с расписанием, ученики. Записывает всё сразу на
//последнем шаге одним вызовом УЗ_Общий.ВыполнитьПервуюНастройку (одна транзакция; повторный запуск ничего не
//дублирует — найденное по наименованию берётся как есть). Итог — журнал «Создано / Уже есть» и кнопка «Создать
//уроки на неделю» (помощник создания уроков с этой группой). Открывается сам при первом входе руководителя, пока
//в базе нет ни одного человека (УЗ_Сервер.НуженПервыйЗапуск), и командой «Первоначальная настройка» раздела
//«Настройки». Без модальных окон: ошибка шага — сообщение у поля. Тест — tools\тесты\тест_первый_запуск.py.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Настройки = РегистрыСведений.УЗ_Настройки.Настройки();
	Организация = Настройки.Организация;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = ЕдинственнаяОрганизация();
	КонецЕсли;
	Касса = ?(ЗначениеЗаполнено(Настройки.Касса), Строка(Настройки.Касса), НСтр("ru = 'Основная касса'"));
	АбонементЗанятий = 8;
	Продолжительность = '00010101010000';
	Педагоги.Добавить();
	Ученики.Добавить();
	Шаг = 1;
	ПоказатьШаг(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)

	Если Шаг > 1 Тогда
		Шаг = Шаг - 1;
		ПоказатьШаг(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)

	Если Не ШагЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	Если Шаг = ПоследнийШагВвода() Тогда
		Если Не ВыполнитьНастройкуНаСервере() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Шаг = Шаг + 1;
	ПоказатьШаг(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьУрокиНаНеделю(Команда)

	Если Не ЗначениеЗаполнено(ГруппаОбучения) Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Документ.УЗ_Урок.Форма.ПомощникСозданияУроков", Новый Структура("ГруппаОбучения", ГруппаОбучения));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоследнийШагВвода()

	Возврат 7;

КонецФункции

//Страница и кнопки текущего шага: «Назад» — со второго шага, «Далее» на последнем шаге ввода называется
//«Создать», на итоговой странице её нет.
&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьШаг(Форма)

	Шаг = Форма.Шаг;
	Страницы = СтрРазделить("Организация,Касса,Предметы,Педагоги,Цена,Группа,Ученики,Итог", ",");
	Форма.Элементы.Шаги.ТекущаяСтраница = Форма.Элементы["Страница" + Страницы[Шаг - 1]];
	Форма.Элементы.ФормаНазад.Доступность = (Шаг > 1);
	Форма.Элементы.ФормаДалее.Видимость = (Шаг <= ПоследнийШагВвода());
	Форма.Элементы.ФормаДалее.Заголовок = ?(Шаг = ПоследнийШагВвода(), НСтр("ru = 'Создать'"), НСтр("ru = 'Далее'"));

КонецПроцедуры

//Проверка заполнения текущего шага: сообщения — у полей, переход дальше только без ошибок.
&НаКлиенте
Функция ШагЗаполнен()

	Отказ = Ложь;
	Если Шаг = 1 Тогда
		Если Не ЗначениеЗаполнено(Организация) Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выберите организацию'"), "Организация", , Отказ);
		КонецЕсли;
	ИначеЕсли Шаг = 2 Тогда
		Если ПустаяСтрока(Касса) Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите название кассы'"), "Касса", , Отказ);
		КонецЕсли;
	ИначеЕсли Шаг = 3 Тогда
		Если ПустаяСтрока(СтрЗаменить(СтрЗаменить(СтрЗаменить(Предметы, ",", ""), ";", ""), Символы.ПС, "")) Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите хотя бы один предмет'"), "Предметы", , Отказ);
		КонецЕсли;
	ИначеЕсли Шаг = 4 Тогда
		ПроверитьПедагогов(Отказ);
	ИначеЕсли Шаг = 5 Тогда
		Если ЦенаЗанятия = 0 И (АбонементЗанятий = 0 Или ЦенаАбонемента = 0) Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите цену занятия или абонемента'"), "ЦенаЗанятия",
				, Отказ);
		КонецЕсли;
		Если ЦенаАбонемента > 0 И АбонементЗанятий = 0 Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите, на сколько занятий абонемент'"),
				"АбонементЗанятий", , Отказ);
		КонецЕсли;
	ИначеЕсли Шаг = 6 Тогда
		ПроверитьГруппу(Отказ);
	ИначеЕсли Шаг = 7 Тогда
		ПроверитьУчеников(Отказ);
	КонецЕсли;
	Возврат Не Отказ;

КонецФункции

&НаКлиенте
Процедура ПроверитьПедагогов(Отказ)

	Заполнено = 0;
	Для Каждого СтрокаПедагога Из Педагоги Цикл
		Индекс = Педагоги.Индекс(СтрокаПедагога);
		Если ПустаяСтрока(СтрокаПедагога.ФИО) Тогда
			Если СтрокаПедагога.ЗаЗанятие > 0 Или СтрокаПедагога.ЗаЧас > 0 Тогда
				УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите ФИО педагога'"),
					СтрШаблон("Педагоги[%1].ФИО", Формат(Индекс, "ЧН=0; ЧГ=")), , Отказ);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Заполнено = Заполнено + 1;
		Если СтрокаПедагога.ЗаЗанятие = 0 И СтрокаПедагога.ЗаЧас = 0 Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите оплату педагогу: за занятие или за час'"),
				СтрШаблон("Педагоги[%1].ЗаЗанятие", Формат(Индекс, "ЧН=0; ЧГ=")), , Отказ);
		ИначеЕсли СтрокаПедагога.ЗаЗанятие > 0 И СтрокаПедагога.ЗаЧас > 0 Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Оплата педагогу — либо за занятие, либо за час: оставьте одну сумму'"),
				СтрШаблон("Педагоги[%1].ЗаЧас", Формат(Индекс, "ЧН=0; ЧГ=")), , Отказ);
		КонецЕсли;
	КонецЦикла;
	Если Заполнено = 0 Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите хотя бы одного педагога'"), "Педагоги", , Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьГруппу(Отказ)

	Если ПустаяСтрока(Группа) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите название группы'"), "Группа", , Отказ);
	КонецЕсли;
	Если ДниНедели(ЭтотОбъект) = "" Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отметьте дни занятий группы'"), "ПН", , Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВремяНачала) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите время начала занятий'"), "ВремяНачала", , Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Продолжительность) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите длительность занятия'"), "Продолжительность", ,
			Отказ);
	ИначеЕсли ВремяНачала + (Продолжительность - '00010101') >= '00010102' Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Занятие должно закончиться до полуночи'"),
			"Продолжительность", , Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУчеников(Отказ)

	Заполнено = 0;
	Для Каждого СтрокаУченика Из Ученики Цикл
		Если ПустаяСтрока(СтрокаУченика.ФИО) Тогда
			Если Не ПустаяСтрока(СтрокаУченика.Телефон) Или Не ПустаяСтрока(СтрокаУченика.Родитель) Тогда
				УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите ФИО ученика'"),
					СтрШаблон("Ученики[%1].ФИО", Формат(Ученики.Индекс(СтрокаУченика), "ЧН=0; ЧГ=")), , Отказ);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Заполнено = Заполнено + 1;
	КонецЦикла;
	Если Заполнено = 0 Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите хотя бы одного ученика'"), "Ученики", , Отказ);
	КонецЕсли;

КонецПроцедуры

//Коды отмеченных дней через запятую: «ПН,СР».
&НаКлиентеНаСервереБезКонтекста
Функция ДниНедели(Форма)

	Отмечены = Новый Массив;
	Для Каждого КодДня Из СтрРазделить("ПН,ВТ,СР,ЧТ,ПТ,СБ,ВС", ",") Цикл
		Если Форма[КодДня] Тогда
			Отмечены.Добавить(КодДня);
		КонецЕсли;
	КонецЦикла;
	Возврат СтрСоединить(Отмечены, ",");

КонецФункции

//Организация, если у хозяина она одна (не помеченная на удаление); иначе — пусто, выбрать на первом шаге.
&НаСервереБезКонтекста
Функция ЕдинственнаяОрганизация()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выгрузить();
	Возврат ?(Выборка.Количество() = 1, Выборка[0].Ссылка, Неопределено);

КонецФункции

//Всё введённое — одним вызовом УЗ_Общий.ВыполнитьПервуюНастройку; журнал «Создано / Уже есть» — на итоговую
//страницу. Ошибка записи — сообщение, помощник остаётся на последнем шаге (в базе ничего не записано).
&НаСервере
Функция ВыполнитьНастройкуНаСервере()

	Данные = Новый Структура;
	Данные.Вставить("Организация", Организация);
	Данные.Вставить("Касса", Касса);
	Данные.Вставить("Предметы", Предметы);
	СписокПедагогов = Новый Массив;
	Для Каждого СтрокаПедагога Из Педагоги Цикл
		Если Не ПустаяСтрока(СтрокаПедагога.ФИО) Тогда
			СписокПедагогов.Добавить(
				Новый Структура("ФИО, ЗаЗанятие, ЗаЧас", СтрокаПедагога.ФИО, СтрокаПедагога.ЗаЗанятие,
				СтрокаПедагога.ЗаЧас));
		КонецЕсли;
	КонецЦикла;
	Данные.Вставить("Педагоги", СписокПедагогов);
	Данные.Вставить("ЦенаЗанятия", ЦенаЗанятия);
	Данные.Вставить("АбонементЗанятий", АбонементЗанятий);
	Данные.Вставить("ЦенаАбонемента", ЦенаАбонемента);
	Данные.Вставить("Группа", Группа);
	Данные.Вставить("ДниНедели", ДниНедели(ЭтотОбъект));
	Данные.Вставить("ВремяНачала", ВремяНачала);
	Данные.Вставить("Продолжительность", Продолжительность);
	СписокУчеников = Новый Массив;
	Для Каждого СтрокаУченика Из Ученики Цикл
		Если Не ПустаяСтрока(СтрокаУченика.ФИО) Тогда
			СписокУчеников.Добавить(
				Новый Структура("ФИО, Телефон, Родитель", СтрокаУченика.ФИО, СтрокаУченика.Телефон,
				СтрокаУченика.Родитель));
		КонецЕсли;
	КонецЦикла;
	Данные.Вставить("Ученики", СписокУчеников);

	Попытка
		Итог = УЗ_Общий.ВыполнитьПервуюНастройку(Данные);
	Исключение
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Настройка не записана: %1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		Возврат Ложь;
	КонецПопытки;

	ГруппаОбучения = Итог.Группа;
	Журнал.Очистить();
	Для Каждого ТекстСтроки Из Итог.Журнал Цикл
		Позиция = СтрНайти(ТекстСтроки, ": ");
		СтрокаЖурнала = Журнал.Добавить();
		СтрокаЖурнала.Результат = ?(Позиция = 0, "", Лев(ТекстСтроки, Позиция - 1));
		СтрокаЖурнала.Объект = ?(Позиция = 0, ТекстСтроки, Сред(ТекстСтроки, Позиция + 2));
	КонецЦикла;
	Элементы.ПояснениеИтог.Заголовок =
		СтрШаблон(НСтр(
		"ru = 'Создано объектов: %1. Если чего-то не хватает — вернитесь «Назад», допишите и снова нажмите «Создать»: "
		+ "то, что уже есть в базе, помощник второй раз не создаёт. Дальше — «Создать уроки на неделю»: уроки группы "
		+ "«%2» по расписанию на 7 дней вперёд.'"),
		Итог.Создано, Группа);
	Возврат Истина;

КонецФункции

#КонецОбласти
